<template>
    <div class="note-box">
        <div class="note-header">
            <h3 class="title">
                創傷流程速記
            </h3>
            <small>
            </small>
        </div>
        <div class="note-body">
            <div class="video-player-box">
                <iframe class="video-player" width="100%" src="https://www.youtube.com/embed/nNhrToqUXYM" allow="accelerometer; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
            </div>

            <markdown
                class="memo-content"
                :content="content"
            ></markdown>
        </div>
    </div>
</template>
<script>
import { mapActions, mapMutations, mapGetters } from 'vuex';
import BoxDefault from 'lib/common/mixins/BoxDefault';
// import $ from 'jquery';
// import 'bootstrap';

// import 'app';
// import { string, jsVars, popup, trackJS, localStorage, ppPanel } from 'lib/common/util';

export default {
    components: {},
    mixins: [BoxDefault],
    filters: {},
    props: {},
    data(){
        return {
            flowPic: './dist/img/flow/EMT-OHCAFlow@2x.png',
            content: `

---- 現場評估 ----
~~~~
    評估現場環境是否安全
    已有交通管制 安全
    戴手套口罩 必要時戴護目鏡穿隔離衣
    先生 我們是救護人員來協助你
~~~~


----- 頸椎限制 -----
~~~~
    我懷疑你有頸椎傷害 請不要動
    我將請副手過去保護你的頸椎
~~~~
> 副手使用肩頸固定


----- X 大出血 -----
~~~~
    快速目視全身有無大出血
    無發現大出血
~~~~

----- 意識 -----
~~~
    先生先生
    我覺得胸口痛 好喘啊
    意識清楚
~~~~

----- A 呼吸道 ----
~~~~
    評估呼吸道有無鼾音雜音
    沒有異音
~~~~

----- B 呼吸 ----
~~~~
    評估呼吸深淺快慢 評估時間不超過10秒鐘
    每10秒鐘4次 張口呼吸
    給予簡單面罩
~~~~


----- C 循環 -----
~~~~
    ** 評估兩側橈動脈 **
    對等 摸得到
    ** 評估微血管回填充時間 **
    大於2秒
    ** 評估末梢肢體是否濕冷 **
    溼冷
    ** 評估膚色是否蒼白 **
    蒼白
    ** 臉色是否發紺 **
    正常
~~~~

----- D 失能 -----

GCS
~~~~
    先生 你可以看著我 跟我說你的名字 手可以舉起來嗎？
    我叫李大強
    手可以舉起來
    傷患意識清楚 GCS15分
~~~~

瞳孔
~~~~
    檢查兩側瞳孔
    3mm 等大
    對光有無反應
    正常
~~~~

四肢運動
~~~~
    先生 我這樣摸你的手有感覺請動一下
    正常
    先生 我這樣摸你的腳有感覺請動一下
    正常
~~~~

------ E 暴露 傷患身體 ------

傷口檢查
~~~~
    快速檢查頭頸胸腹骨盆四肢有無致命性傷口
    先生 我要檢查一下你的胸部
    先生 我要檢查一下你的腹部
    沒有發現致命性傷口
~~~~

頸
~~~~
    檢查氣管是否偏移 頸靜脈是否怒張
    正常
    檢查頸椎是否壓痛異常
    先生 我要檢查一下你的頸椎 會痛請告訴我
    好痛
    頸椎有壓痛現象
~~~~

骨盆
~~~~
    檢查骨盆是否穩固
    穩固
~~~~

四肢
~~~~
    必要時暴露四肢
    正常
~~~~

---- 輔助評估 ----
~~~~
    測量血壓脈搏
    測量血氧
    血氧89%
    血壓102/60mm-Hg
    脈搏115次/分
~~~~

---- 機轉 病史 ----
~~~~
    先生 你剛剛發生什麼事？
    我剛剛騎摩托車自摔
    有沒有戴安全帽？
    沒有
    車速大概多快？
    我大概騎50~60km/hr
~~~~

主訴
~~~~
    你現在覺得哪裡不舒服？怎麼不舒服？不舒服多久了？
    我覺得胸口痛 很喘 大概已經5分鐘
~~~~

吃
~~~~
    你上一餐是什麼時候吃的？
    我早上9點吃
~~~~

過
~~~~
    有沒有什麼過去病史？
    沒有
~~~~

藥
~~~~
    有沒有在服用什麼藥物？
    沒有
~~~~

敏
~~~~
    對藥物食物會過敏嗎？
    不會
~~~~

感
~~~~
    還有沒有覺得其他地方不舒服？
    沒有
~~~~

----評估 ASL BSL---
~~~~
    傷患騎車自摔 沒有戴安全帽
    時速大概50km/hr 目前覺得胸口痛呼吸喘
    傷患血氧未滿90%
    微血管回充填時間大於2秒
    且騎車自摔
    時速大於50km/hr以上 為高能量機轉
    符合危急個案 我們立即後送
    因傷患為高能量機轉
~~~~

----- 戴頸圈 與 上長背板 ------
~~~~
    且頸椎有壓痛現象
    我們以頸圈長背板固定
    先生 我們懷疑你頸椎有傷害
    現在要幫你戴上頸圈
    可能有點不舒服 請你忍耐一下
    測量傷患下巴至肩線距離
    調整適當頸圈
    上長背板
~~~~


----- 二評 八大生命徵象 -----
設備檢查
~~~~
    測量血壓脈搏
    測量血氧
    測量體溫
    體溫36.5°C
    血氧94%
    血壓105/60mm-Hg
    脈搏115次/分
~~~~

GCS
~~~~
    先生 你可以看著我
    告訴我你的名字 手可以動一下嗎？
    我叫李大強 手可以動
    病患意識清楚 GCS15分
~~~~

瞳孔
~~~~
    評估兩側瞳孔是否等大
    3mm 等大
    對光是否有反應
    正常
~~~~

呼吸
~~~~
    評估呼吸
    10秒4次
~~~~

膚色
~~~~
    評估膚色
    蒼白
~~~~

---- 二評 頭 -----
~~~~
    檢查後腦是否出血血腫
    檢查額骨顴骨下顎骨是否穩固
    檢查是否有耳漏 鼻漏 熊貓眼 耳後瘀青
    正常
~~~

---- 二評 胸 -----
~~~~
    先生 我現在要檢查一下你的胸部
    ** 視診胸部有無瘀傷傷口 **
    ** 檢查鎖骨 **
    ** 上胸 **
    ** 下胸是否穩固 **
    ** 呼吸起伏是否對等 **
    正常
    ** 聽診兩側肺音是否對等清晰 *8
    正常
~~~~

---- 二評 腹 -----
~~~~
    先生 我要檢查一下你的腹部
    ** 視診腹部是否腫脹 **
    正常
    先生 以你肚臍分為四個象限
    ** 請問有哪裡比較不舒服嗎？ **
    沒有
    ** 檢查腹部是否有壓痛 **
    正常
~~~~

---- 二評 上肢 -----
~~~~
    ** 檢查上肢有無瘀傷傷口腫脹變形 **
    上肢是否等長
    正常
    ** 檢查下肢有無瘀傷傷口腫脹變形 **
    下肢是否等長
    正常
~~~~

----通報-----
~~~~
    指揮中心 旺英91車上載送男性50歲
    主要問題為車禍自摔
    胸痛呼吸喘
    血氧89% 微血管回充填時間大於2秒
    無過去病史
    已給簡單面罩6公升/分鐘
    目前生命徵象 血氧94%
    血壓105/60mm-Hg
    脈搏115次/分
    其他生命徵象正常
    預計5分鐘後到達醫院
~~~~
`,
        };
    },
    computed: {
        ...mapGetters([
            'PageSetting_width',
        ]),
        isMobile(){
            return this.PageSetting_width < 700;
        },
    },
    watch: {
    },
    created(){},
    mounted(){

    },
    updated(){},
    destroyed(){},
    methods: {
        ...mapActions({}),
        ...mapMutations({}),
    },
};
</script>
<style lang="scss" scoped>
</style>